Show / Hide Table of Contents
Class LoadOnLine
Load on line
Inheritance
System.Object
OpenObject
OpenElementId
LoadOnLine
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.LoadOnLine,CI.Loading", "CI.StructModel.Loading.ILoadOnLine,CI.BasicTypes")]
public class LoadOnLine : OpenElementId
Examples
This sample shows how to create a load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Uniform load on line2 - relative between 0.1-0.6. In the LCS of line. -2kN in the z-direction
LoadOnLine loadLine = new LoadOnLine();
loadLine.Bimp = new LoadImpulse() { Z = -2e3 };
loadLine.Eimp = new LoadImpulse() { Z = -2e3 };
loadLine.Type = LoadType.LoadForce;
loadLine.Direction = LoadDirection.InLcs;
loadLine.Geometry = new ReferenceElement(line2);
loadLine.LoadProjection = LoadProjection.Length;
loadLine.RelativeBeginPosition = 0.1;
loadLine.RelativeBeginPosition = 0.6;
openModel.AddObject(loadLine);
loadCase.LoadsOnLine.Add(new ReferenceElement(loadLine));
Constructors
Improve this Doc   View Source
LoadOnLine()
Constructor
Declaration
public LoadOnLine()
Properties
Improve this Doc   View Source
Bimp
Impulse at the begin
Declaration
public LoadImpulse Bimp { get; set; }
Property Value
 Type |  Description
 LoadImpulse
Improve this Doc   View Source
Direction
1=global, 0=local
Declaration
public LoadDirection Direction { get; set; }
Property Value
 Type |  Description
 LoadDirection
Improve this Doc   View Source
Eimp
Impulse at the end
Declaration
public LoadImpulse Eimp { get; set; }
Property Value
 Type |  Description
 LoadImpulse
Improve this Doc   View Source
ExY
Eccentricity local Y on the beginning
Declaration
public double ExY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExYEnd
Eccentricity local Y at the end
Declaration
public double ExYEnd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExZ
Eccentricity local Z on the beginning
Declaration
public double ExZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ExZEnd
Eccentricity local Z at the end
Declaration
public double ExZEnd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Geometry
Segment3D or PolyLine3D
Declaration
public ReferenceElement Geometry { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
LoadProjection
Gets, sets load projection
Declaration
public LoadProjection LoadProjection { get; set; }
Property Value
 Type |  Description
 LoadProjection
Improve this Doc   View Source
RelativeBeginPosition
Begin position on Segment3D
Declaration
public double RelativeBeginPosition { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
RelativeEndPosition
End position on Segment3D
Declaration
public double RelativeEndPosition { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Type
Type of load
Declaration
public LoadType Type { get; set; }
Property Value
 Type |  Description
 LoadType
 Improve this Doc
 View Source